begin tran
	  select *
	  into tblЗаказыПоставщикамСп1_bak_20191011a
	  FROM dbo.tblЗаказыПоставщикамСп1
	  WHERE ([Заказ] = '00492-z00399') and Поставщик = 'GER'
	  
	  delete  FROM dbo.tblЗаказыПоставщикамСп1
	  WHERE ([Заказ] = '00492-z00399') and Поставщик = 'GER'
	  
	  select * 
	  into tblЗаказыПоставщикам_bak_20191011a
	  from dbo.tblЗаказыПоставщикам where Поставщик = 'GER' and Пачка = '00596'
	  
	  delete from dbo.tblЗаказыПоставщикам where Поставщик = 'GER' and Пачка = '00596'

	  select *
	  FROM dbo.tblЗаказыПоставщикамСп1
	  WHERE ([Заказ] = '00492-z00399')

commit

--rollback

begin tran

set identity_insert tblЗаказыПоставщикам on;
insert into tblЗаказыПоставщикам(Код,Поставщик,Пачка,Дата_отп,Дата_кон,Отправлено,Примечание)
select Код,Поставщик,Пачка,Дата_отп,Дата_кон,Отправлено,Примечание
 from tblЗаказыПоставщикам_bak_20191011;
set identity_insert tblЗаказыПоставщикам off;

set identity_insert tblЗаказыПоставщикамСп1 on;
insert into tblЗаказыПоставщикамСп1(Код,Код_заказа,Поставщик,Код_поставки,Пачка,ID,Статус,Дата_отп,Дата_кон,Дата_пол,Заказано,Заказано_all
		,Получено,Заказ,На_поставке,Приход,Примечание,A,[Растворитель для спектра],Дата_кон_0,ЗарпХимику)
select Код,Код_заказа,Поставщик,Код_поставки,Пачка,ID,Статус,Дата_отп,Дата_кон,Дата_пол,Заказано,Заказано_all
		,Получено,Заказ,На_поставке,Приход,Примечание,A,[Растворитель для спектра],Дата_кон_0,ЗарпХимику
 from tblЗаказыПоставщикамСп1_bak_20191011;
set identity_insert tblЗаказыПоставщикамСп1 off;

commit


begin tran	  

	select * 
	into tblСписокЗаказов_bak_20190924
	from tblСписокЗаказов where Код_заказчика  = '30050' and Код_заказа = 'z00071';


	insert into tblВыполненныеЗаказы([Код_ID], [ID], Код_заказчика, Код_заказа, [Код], Код_отправки)
	select [Код_ID], [ID], Код_заказчика, Код_заказа, [Код], '997' 
	from tblСписокЗаказов where Код_заказчика  = '30050' and Код_заказа = 'z00071';

	delete from tblСписокЗаказов where Код_заказчика  = '30050' and Код_заказа = 'z00071';
commit

select * 
from tblСписокЗаказов where Код_заказчика  = '30050' and Код_заказа = 'z00071';
select * 
from tblСписокЗаказов_bak_20190924 where Код_заказчика  = '30050' and Код_заказа = 'z00071';

begin tran

	set identity_insert tblВыполненныеЗаказы on

	insert into tblВыполненныеЗаказы([Код_ID], [ID], Код_заказчика, Код_заказа, [Код], Код_отправки)
	select [Код_ID], [ID], Код_заказчика, Код_заказа, [Код], '997' 
	from tblСписокЗаказов_bak_20190924 
	where Код_заказчика  = '30050' and Код_заказа = 'z00071';

	set identity_insert tblВыполненныеЗаказы off

commit



begin tran

	  select *
	  into tblЗаказыПоставщикамСп1_bak_20191022
	  FROM dbo.tblЗаказыПоставщикамСп1
	  WHERE ([Заказ] = '90122-z01732') and Поставщик = 'BSB'
	  
	  delete  FROM dbo.tblЗаказыПоставщикамСп1
	  WHERE ([Заказ] = '90122-z01732') and Поставщик = 'BSB'

	  select * 
	  into tblЗаказыПоставщикам_bak_20191022
	  from dbo.tblЗаказыПоставщикам where Поставщик = 'BSB' and Пачка = '00597'
	  
	  delete from dbo.tblЗаказыПоставщикам where Поставщик = 'BSB' and Пачка = '00597'


commit
/********************************************/
/*
Володя, аннулируйте, пожалуйста  заказ

00105-z00239     консигнация

Спасибо.

С ув. Любовь С

*/
select * 
--into tblСписокЗаказов_bak_20191112
from tblСписокЗаказов where Код_заказчика  = '00105' and Код_заказа = 'z00239';
select * 
--into tblЗаказы_bak_20191112
from tblЗаказы  where Код_заказчика  = '00105' and Код_заказа = 'z00239';

select * 
from tblСписокЗаказов_bak_20191112 ;
select * 
from tblЗаказы_bak_20191112  where Код_заказчика  = '00105' and Код_заказа = 'z00239'

begin tran

	delete from tblСписокЗаказов where Код_заказчика  = '00105' and Код_заказа = 'z00239';
	delete from tblЗаказы  where Код_заказчика  = '00105' and Код_заказа = 'z00239';
	
commit -- rollback



