/*
Володя! Исправь, пожалуйста!

Я ввела заказ 10050-z00210 
на
p00153    KSN   26  веществ,

а надо в новую пачку   p00097    RIN


Спасибо, жду поправки.

С уважением, Люба С
*/

select * 
from tblЗаказыПоставщикам
where Поставщик = 'KSN' and [Пачка] = 153
;
select * 
from tblЗаказыПоставщикам
where Поставщик = 'RIN' and [Пачка] = 97
;


SELECT [Код]
      ,[Код_заказа]
      ,[Поставщик]
      ,[Код_поставки]
      ,[Пачка]
      ,[ID]
      ,[Статус]
      ,[Дата_отп]
      ,[Дата_кон]
      ,[Дата_пол]
      ,[Заказано]
      ,[Заказано_all]
      ,[Получено]
      ,[Заказ]
      ,[На_поставке]
      ,[Приход]
      ,[Примечание]
      ,[A]
      ,[Растворитель для спектра]
      ,[Дата_кон_0]
      ,[ЗарпХимику]
  FROM [Chest35].[dbo].[tblЗаказыПоставщикамСп1]
  where [Заказ] = '10050-z00210' --Поставщик = 'KSN' and [Пачка] = 153
GO


begin tran

	update tblЗаказыПоставщикам set Поставщик = 'RIN' , [Пачка] = 97
	where Поставщик = 'KSN' and [Пачка] = 153
	;

	update tblЗаказыПоставщикамСп1 set Поставщик = 'RIN' , [Пачка] = 97
	where [Заказ] = '10050-z00210' and Поставщик = 'KSN' and [Пачка] = 153
	;
commit
