SELECT [Код_ID]
      ,[ID]
      ,[ID_заказчика]
      ,[Код_заказчика]
      ,[Код_заказа]
      ,[Код_отправки]
      ,[Заказано]
      ,[Заказано_реально]
      ,[Взвешено]
      ,[Код_поставщика]
      ,[Код_поставки]
      ,[Поставка]
      ,[Индикатор]
      ,[Бокс]
      ,[Строка]
      ,[Колонка]
      ,[Barcode]
      ,[Box_Barcode]
  FROM [Chest35].[dbo].[Распр_3]
	where [Код_заказчика] = '00108' and [Код_заказа] = 'z01251'
GO

SELECT *
  FROM [Chest35].[dbo].[Распр_1]
	where [Код_заказчика] = '00108' and [Код_заказа] = 'z01251'
	
select * from tblЗаказы z where z.Код_заказчика  = '00108'and [Код_заказа] = 'z01251'	

--код из обработчика события кнопки "Распределить" 
--UPDATE [tblСписокЗаказов]  
--SET Box_номер = '2', Box_строка = 'E', Box_колонка = '9',      Код_поставщика = 'LAV', Код_поставки = '2949'  
--WHERE Код_ID = 9244752 AND        (          (Box_номер is null) or (Box_номер = 'n') or          (Box_строка is null) or (Box_строка = 'n') or          (Box_колонка is null) or (Box_колонка = 'n')        ) 

/* для очистки распределения нужно прописать в бокс, строку и колонку 'n' или null */

UPDATE [tblСписокЗаказов]  
SET Box_номер = 'n', Box_строка = 'n', Box_колонка = 'n' 
--select * from [tblСписокЗаказов]
WHERE  [Код_заказчика] = '00108' and [Код_заказа] = 'z01251' and Код_отправки = 's999' --and Box_номер = ''

exec sp_helptext [Распр_3]
exec sp_helptext [Распр_1]
exec sp_helptext [Распр_0]
