SELECT [Аббревиатура]
      ,[Пользователь]
      ,[WinLogin]
  FROM [Chest35].[dbo].[tblПользователи]
  where ([Расширенная_информация_по_запросам] = 1 or [Решение_по_запросам] = 1)
 order by [Пользователь];

GO

SELECT [Код]
      ,[Аббревиатура]
      ,[Пользователь]
      ,[Сортировка]
      ,[Ввод_заказов]
      ,[Ввод_запросов]
      ,[Торги_по_запросам]
      ,[Решение_по_запросам]
      ,[Enabled]
      ,[Вход_в_программу_Запросов]
      ,[Расширенная_информация_по_запросам]
      ,[Ответ_заказчику_по_запросу]
      ,[WinLogin]
  FROM [Chest35].[dbo].[tblПользователи]
  where  [Enabled] = 0 and
       ([Расширенная_информация_по_запросам] = 1 
       or [Решение_по_запросам] = 1
      or [Торги_по_запросам] = 1
      or [Ввод_запросов] = 1
      or [Ответ_заказчику_по_запросу] = 1
      or [Вход_в_программу_Запросов] = 1);

/*
update t
set 
      [Ввод_заказов] = 0
      ,[Ввод_запросов] = 0
      ,[Торги_по_запросам] = 0
      ,[Решение_по_запросам] = 0
      --,[Enabled]
      ,[Вход_в_программу_Запросов] = 0
      ,[Расширенная_информация_по_запросам] = 0
      ,[Ответ_заказчику_по_запросу] = 0
  FROM [Chest35].[dbo].[tblПользователи] t
  where  [Enabled] = 0 and
       ([Расширенная_информация_по_запросам] = 1 
      or [Решение_по_запросам] = 1
      or [Торги_по_запросам] = 1
      or [Ввод_запросов] = 1
      or [Ответ_заказчику_по_запросу] = 1
      or [Вход_в_программу_Запросов] = 1)
      */
    
 